code-review/NRB_3471_3546/База_Было/Documents/ВводДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводДивидендов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДивидендыИКупоны</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИПД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий250</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаИПД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДивиденды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ВводДивидендов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьДивиденды(Команда)
	
	ЗаполнитьДивидендыНаСервере();
	
	ДивидендПриИзменении(Элементы.СуммаИПД);
	
КонецПроцедуры

&НаКлиенте
Процедура ДивидендПриИзменении(Элемент)
	Перем СуммаДивидендов;
	
	ВсегоБумаг = Объект.ТаблицаДивиденды.Итог("Количество");
	Если ВсегоБумаг > 0 Тогда
		Для Каждого ЭлементСтроки Из Объект.ТаблицаДивиденды Цикл
			ЭлементСтроки.Сумма = Объект.СуммаИПД * ЭлементСтроки.Количество / ВсегоБумаг;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДивидендов = Объект.ТаблицаДивиденды.Итог("Сумма");
	Если СуммаДивидендов <> Объект.СуммаИПД Тогда
		Объект.ТаблицаДивиденды[Объект.ТаблицаДивиденды.Количество()-1].Сумма = 
			Объект.ТаблицаДивиденды[Объект.ТаблицаДивиденды.Количество()-1].Сумма
			+ Объект.СуммаИПД - СуммаДивидендов;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДивиденды(Команда)
	Объект.ТаблицаДивиденды.Очистить();
	Объект.СуммаИПД	= 0;
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	ДатаПроверки	= ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата);
	
	ЦенныеБумагиКлиент.ЦеннаяБумагаПроверкаВыборка(ВыбранноеЗначение, ДатаПроверки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДивидендыПриИзменении(Элемент)
	ДивидендПриИзменении(Элементы.СуммаИПД);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДивидендыНаСервере()
	
	Объект.ТаблицаДивиденды.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетДепо.Владелец			КАК Депонент,
	|	СчетДепо					КАК СчетДепо,
	|	СУММА(КоличествоОстаток)	КАК Количество
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ДатаОстатков, ЦБ = &ЦеннаяБумага)
	|СГРУППИРОВАТЬ ПО
	|	СчетДепо,
	|	СчетДепо.Владелец
	|ИМЕЮЩИЕ
	|	СУММА(КоличествоОстаток) > 0";
	Граница = Новый Граница(КонецДня(Объект.ДатаФиксации), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ДатаОстатков", Граница);
	Запрос.УстановитьПараметр("ЦеннаяБумага", Объект.ЦеннаяБумага);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТабличнойЧасти = Объект.ТаблицаДивиденды.Добавить();
		СтрокаТабличнойЧасти.Депонент 		= Выборка.Депонент;
		СтрокаТабличнойЧасти.СчетДЕПО 		= Выборка.СчетДепо;
		СтрокаТабличнойЧасти.ЦеннаяБумага	= Объект.ЦеннаяБумага;
		СтрокаТабличнойЧасти.Количество 	= Выборка.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры
